InformationRegisters/СоответствиеСокращенныхНомеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеСокращенныхНомеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерСокращенный</Name>
					<Comment>Соответствующий сокращенный номер.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номер</Name>
					<Comment>Номер документа.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/УправлениеДокументами/Ext/Module.bsl
Функция ПолучитьНомерСокращенный(Номер) Экспорт
	
	Количество = Метаданные.РегистрыСведений.СоответствиеСокращенныхНомеров.Измерения.Номер.Тип.КвалификаторыЧисла.Разрядность;
	
	// Соответсвие.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СоответствиеСокращенныхНомеров.НомерСокращенный
	                      |ИЗ
	                      |	РегистрСведений.СоответствиеСокращенныхНомеров КАК СоответствиеСокращенныхНомеров
	                      |ГДЕ
	                      |	СоответствиеСокращенныхНомеров.Номер = &Номер");
	Запрос.УстановитьПараметр("Номер", ОбщегоНазначения.ПолучитьЧисло(УправлениеКонтактнойИнформацией.ПолучитьТолькоЦифры(Номер)) % Pow(10, Количество));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Строка(Неопределено);
	КонецЕсли;
	
	// Результат.
	Возврат Формат(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("НомерСокращенный")[0], "ЧЦ=" + Количество + "; ЧДЦ=0; ЧН=; ЧВН=; ЧГ=");
	
КонецФункции // ПолучитьНомерСокращенный()
